InformationRegisters/КонтактыCustomer360.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактыCustomer360</Name>
			<Comment>Контакты, переданные с Customer360</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодДилера</Name>
					<Comment>Код дилера Customer360</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТипаЛида</Name>
					<Comment>Код типа лида в Customer360</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛидЗакрыт</Name>
					<Comment>Лид закрыт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>Дата изменения состояния контакта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Comment>Ссылка на соответствующий Рабочий лист</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистСервиса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛидИД</Name>
					<Comment>Идентификатор лида с Customer360</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
			<Comment>Типы сообщений документа "Событие"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСмит</Name>
					<Comment>Только Ниссан</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСмит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменнаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоменнойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/Customer360/Ext/Module.bsl
Функция WebhookPOST(Запрос)
	КодДилера = Запрос.ПараметрыURL["DealerCode"];
	стрАутентификации = СМ_ПроцедурыДляNissanAftersales.СтрокаАутентификации(КодДилера);
	
	Если обЗначениеНеЗаполнено(стрАутентификации) Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Некорректный параметр URL: " + КодДилера + "!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Попытка
		стЗапрос = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецПопытки;
	
	Если стЗапрос.action = "new_lead" Тогда // передан новый лид	
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(стЗапрос.lead_id, стрАутентификации);
		Если ЗначениеЗаполнено(стДанныеЛида.error) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стДанныеЛида.error, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
		стрОшибка = ОбработатьНовыйЛид(КодДилера, стДанныеЛида.lead_info);
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_data_updated" Тогда // было изменение в данных лида
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(стЗапрос.lead_id, стрАутентификации);
		Если ЗначениеЗаполнено(стДанныеЛида.error) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стДанныеЛида.error, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
		стрОшибка = ОбработатьИзменениеДанныхЛида(стДанныеЛида.lead_info);
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_status_updated" Тогда // было изменение статуса лида
		стрОшибка = ОбработатьИзменениеСтатусаЛида(стЗапрос.lead_id, стЗапрос.payload, стрАутентификации); 
		Если ЗначениеЗаполнено(стрОшибка) Тогда
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(стрОшибка, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
			Возврат Ответ;
		КонецЕсли;
		
	ИначеЕсли стЗапрос.action = "lead_overdue" Тогда // лид был просрочен в процессе обработки
		ОбработатьПросроченныйЛид(стЗапрос.lead_id);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция ОбработатьНовыйЛид(КодДилера, ДанныеЛида)
	стрОшибка = "";	
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ДанныеЛида.lead_id;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() > 0 Тогда
		Возврат стрОшибка;
	КонецЕсли;
		
	Если КодДилера = "21112401" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); //Олимп Моторс (Шахты)
	ИначеЕсли КодДилера = "21409201" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160"); //Олимп Моторс (Шахты)
	ИначеЕсли КодДилера = "21115701" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190"); //Волгодонск Ниссан
	КонецЕсли;
	
	РабочийЛистСсылка = СоздатьРабочийЛист(Подразделение, ДанныеЛида);	
	Если ЗначениеЗаполнено(РабочийЛистСсылка) Тогда
		мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
		мзКонтакт.СсылкаНаОбъект = РабочийЛистСсылка;
		мзКонтакт.ЛидИД = ДанныеЛида.lead_id;
		мзКонтакт.КодДилера = КодДилера;
		мзКонтакт.КодТипаЛида = ДанныеЛида.type_id;
		мзКонтакт.ЛидЗакрыт = Ложь;
		мзКонтакт.ДатаИзменения = ТекущаяДата();
		мзКонтакт.Записать();
		
		СобытиеСсылка = СоздатьСобытие(РабочийЛистСсылка, ДанныеЛида);
		Если обЗначениеНеЗаполнено(СобытиеСсылка) Тогда
			стрОшибка = "Обработать новый лид: не удалось записать событие!";
		КонецЕсли;
		
	Иначе
		стрОшибка = "Обработать новый лид: не удалось записать рабочий лист!";
	КонецЕсли;
	
	Возврат стрОшибка;
КонецФункции

Функция СоздатьРабочийЛист(Подразделение, ДанныеЛида)
	РабочийЛистОбъект = Документы.РабочийЛист.СоздатьДокумент();		
	РабочийЛистОбъект.ХозОперация = Справочники.ХозОперации.РабочийЛист;
	РабочийЛистОбъект.Дата = ТекущаяДата();
	РабочийЛистОбъект.Организация = Подразделение.Организация;
	РабочийЛистОбъект.ПодразделениеКомпании = Подразделение;
	РабочийЛистОбъект.УстановитьНовыйНомер();	
	
	РабочийЛистОбъект.Автор = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Подразделение.РуководительОП);	
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Автор) Тогда
		РабочийЛистОбъект.Автор = РабочийЛистОбъект.Организация.РуководительКлиенскойСлужбы;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Автор) Тогда
		РабочийЛистОбъект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	СтрокаПользователь = РабочийЛистОбъект.Пользователи.Добавить();
	СтрокаПользователь.Пользователь	= РабочийЛистОбъект.Автор; 			
	РабочийЛистОбъект.РуководительМенеджера = РабочийЛистОбъект.Автор.Сотрудник;
		
	КонецРабочегоДня = Дата(Год(РабочийЛистОбъект.Дата), Месяц(РабочийЛистОбъект.Дата), День(РабочийЛистОбъект.Дата), 19, 0, 0);
	ДатаНачала = РабочийЛистОбъект.Дата + 7200;
	Если ДатаНачала > КонецРабочегоДня Тогда
		ДатаНачала = РабочийЛистОбъект.Дата + 54000; // через 15 часов
	КонецЕсли;	
	РабочийЛистОбъект.Менеджер = СМ_ФормированиеНовыхОбъектов.СлучайныйВыборСотрудника(Подразделение, Справочники.Должности.МенеджерОтделаПродажАвтомобилей, ДатаНачала);
	
	Если обЗначениеНеЗаполнено(РабочийЛистОбъект.Менеджер) Тогда
		РабочийЛистОбъект.Менеджер = РабочийЛистОбъект.РуководительМенеджера;
	КонецЕсли;

	РабочийЛистОбъект.Реклама = Справочники.ИсточникиИнформации.ОбъявлениеОПродажеАвтомобиляВИнтернет;
	РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
	РабочийЛистОбъект.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	РабочийЛистОбъект.ВидКонтакта = Перечисления.ВидыСобытий.ЗаявкаССайта;
	РабочийЛистОбъект.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	РабочийЛистОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");	
	РабочийЛистОбъект.Комментарий = "Создан автоматически контактом с Customer360: " + ДанныеЛида.source_name + Символы.ПС +
		"Причина обращения: " + ДанныеЛида.type_name;

	стКонтакт = ДанныеЛида.contact;
	РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", стКонтакт.last_name, стКонтакт.first_name);
	Если стКонтакт.middle_name <> Неопределено И ЗначениеЗаполнено(стКонтакт.middle_name) Тогда
		РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", РабочийЛистОбъект.Контрагент, стКонтакт.middle_name);
	КонецЕсли;
	
	Если стКонтакт.vin <> Неопределено И ЗначениеЗаполнено(стКонтакт.vin) Тогда
		АвтомобильЛида = Справочники.Автомобили.НайтиПоРеквизиту("VIN", стКонтакт.vin);
		Если ЗначениеЗаполнено(АвтомобильЛида) Тогда
			РабочийЛистОбъект.Автомобиль = АвтомобильЛида;
			РабочийЛистОбъект.Модель = АвтомобильЛида.Модель;
		ИначеЕсли стКонтакт.car_model <> Неопределено И ЗначениеЗаполнено(стКонтакт.car_model) Тогда
			МодельЛида = Справочники.Модели.НайтиПоНаименованию(стКонтакт.car_model);
			Если ЗначениеЗаполнено(МодельЛида) Тогда
				РабочийЛистОбъект.Модель = МодельЛида;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РабочийЛистОбъект.КодРегиона = "+7";
	РабочийЛистОбъект.КодГорода = Лев(стКонтакт.contect_phone, 3);
	РабочийЛистОбъект.НомерТелефона = Сред(стКонтакт.contect_phone, 4, 7);
	РабочийЛистОбъект.ПредставлениеТелефона = РабочийЛистОбъект.КодРегиона + ", " + стКонтакт.contect_phone;	
		
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	
	Возврат РабочийЛистОбъект.Ссылка;
КонецФункции

Функция СоздатьСобытие(РабочийЛистСсылка, ДанныеЛида)
	стрОшибка = "";
	СобытиеОбъект = Документы.Событие.СоздатьДокумент();
	СобытиеОбъект.Заполнить(РабочийЛистСсылка);
	
	СобытиеОбъект.ХозОперация = Справочники.ХозОперации.Событие;
	СобытиеОбъект.ДокументОснование = РабочийЛистСсылка;
	СобытиеОбъект.Автор = РабочийЛистСсылка.Автор;
	СобытиеОбъект.Приоритет = Перечисления.Важность.Высокая;
	СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	СобытиеОбъект.ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
	СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Запланировано;
	СобытиеОбъект.Содержание = "Создан автоматически контактом с Customer360: " + ДанныеЛида.source_name + Символы.ПС +
		"Причина обращения: " + ДанныеЛида.type_name;
		
	КонецРабочегоДня = Дата(Год(СобытиеОбъект.Дата), Месяц(СобытиеОбъект.Дата), День(СобытиеОбъект.Дата), 19, 0, 0);
	ДатаНачала = СобытиеОбъект.Дата + 7200;
	Если ДатаНачала < КонецРабочегоДня Тогда
		СобытиеОбъект.ДатаНачала = ДатаНачала;
	Иначе
		СобытиеОбъект.ДатаНачала = СобытиеОбъект.Дата + 54000; // через 15 часов
	КонецЕсли;
	СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 900;
		
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		СобытиеОбъект.Записать();
	КонецПопытки;
	
	Возврат СобытиеОбъект.Ссылка;
КонецФункции

Функция ОбработатьИзменениеДанныхЛида(ДанныеЛида)
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ДанныеЛида.lead_id;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат "Обновить данные лида: лид не найден!";
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = нзКонтакты[0].СсылкаНаОбъект;
	мзКонтакт.ЛидИД = ДанныеЛида.lead_id;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат "Обновить данные лида: лид не найден!";
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат "";
	КонецЕсли;

	РабочийЛистОбъект = мзКонтакт.СсылкаНаОбъект.ПолучитьОбъект();
	стКонтакт = ДанныеЛида.contact;
	РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", стКонтакт.last_name, стКонтакт.first_name);
	Если стКонтакт.middle_name <> Неопределено И ЗначениеЗаполнено(стКонтакт.middle_name) Тогда
		РабочийЛистОбъект.Контрагент = СтрШаблон("%1 %2", РабочийЛистОбъект.Контрагент, стКонтакт.middle_name);
	КонецЕсли;
	
	Если стКонтакт.vin <> Неопределено И ЗначениеЗаполнено(стКонтакт.vin) Тогда
		АвтомобильЛида = Справочники.Автомобили.НайтиПоРеквизиту("VIN", стКонтакт.vin);
		Если ЗначениеЗаполнено(АвтомобильЛида) Тогда
			РабочийЛистОбъект.Автомобиль = АвтомобильЛида;
			РабочийЛистОбъект.Модель = АвтомобильЛида.Модель;
		ИначеЕсли стКонтакт.car_model <> Неопределено И ЗначениеЗаполнено(стКонтакт.car_model) Тогда
			МодельЛида = Справочники.Модели.НайтиПоНаименованию(стКонтакт.car_model);
			Если ЗначениеЗаполнено(МодельЛида) Тогда
				РабочийЛистОбъект.Модель = МодельЛида;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РабочийЛистОбъект.КодРегиона = "+7";
	РабочийЛистОбъект.КодГорода = Лев(стКонтакт.contect_phone, 3);
	РабочийЛистОбъект.НомерТелефона = Сред(стКонтакт.contect_phone, 4, 7);
	РабочийЛистОбъект.ПредставлениеТелефона = РабочийЛистОбъект.КодРегиона + ", " + стКонтакт.contect_phone;	
		
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	мзКонтакт.ДатаИзменения = ТекущаяДата();
	мзКонтакт.Записать();
	
	Возврат "";
КонецФункции

Функция ОбработатьИзменениеСтатусаЛида(ЛидИД, НовыйСтатус, стрАутентификации)
	нзКонтакты = РегистрыСведений.КонтактыCustomer360.СоздатьНаборЗаписей();
	нзКонтакты.Отбор.ЛидИД.Значение = ЛидИД;
	нзКонтакты.Отбор.ЛидИД.Использование = Истина;
	нзКонтакты.Прочитать();	
	Если нзКонтакты.Количество() = 0 Тогда
		Возврат "Изменить статус лида: лид не найден!";
	КонецЕсли;
	
	мзКонтакт = РегистрыСведений.КонтактыCustomer360.СоздатьМенеджерЗаписи();
	мзКонтакт.СсылкаНаОбъект = нзКонтакты[0].СсылкаНаОбъект;
	мзКонтакт.ЛидИД = ЛидИД;
	мзКонтакт.Прочитать();
	Если Не мзКонтакт.Выбран() Тогда
		Возврат "Изменить статус лида: лид не найден!";
	КонецЕсли;
	
	Если мзКонтакт.ЛидЗакрыт Тогда
		Возврат "";
	КонецЕсли;
	
	ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.ПустаяСсылка();
	Если НовыйСтатус = "refuse" Тогда
		СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.Отказ;
		стДанныеЛида = СМ_ПроцедурыДляNissanAftersales.ПолучитьДанныеЛида(ЛидИД, стрАутентификации);
		Если обЗначениеНеЗаполнено(стДанныеЛида.error) Тогда
			КодПричиныОтказа = стДанныеЛида.lead_info.dealer_refuse_reason_id;
			ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.НайтиПоРеквизиту("КодCustomer360", КодПричиныОтказа);
		КонецЕсли;
		
	ИначеЕсли НовыйСтатус = "bad_phone" Или НовыйСтатус = "not_available" Тогда
		СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.ОшибочныйНомер;
	Иначе
		Возврат "";
	КонецЕсли;
	
	РабочийЛистОбъект = мзКонтакт.СсылкаНаОбъект.ПолучитьОбъект();
	РабочийЛистОбъект.Статус = СтатусРабочегоЛиста;	
	РабочийЛистОбъект.ПричинаОтказа = ПричинаОтказа;
	РабочийЛистОбъект.Комментарий = РабочийЛистОбъект.Комментарий + Символы.ПС + "Лид закрыт на портале Customer360.";
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецПопытки;
	
	ОтменитьЗапланированныеСобытия(мзКонтакт.СсылкаНаОбъект);
	
	мзКонтакт.ЛидЗакрыт = Истина;
	мзКонтакт.ДатаИзменения = ТекущаяДата();
	мзКонтакт.Записать();
	
	Возврат "";
КонецФункции

Процедура ОбработатьПросроченныйЛид(ЛидИД)
КонецПроцедуры

Процедура ОтменитьЗапланированныеСобытия(РабочийЛистСсылка)
	ЗапросСобытия = Новый Запрос();
	ЗапросСобытия.УстановитьПараметр("Запланировано", Перечисления.СостоянияСобытий.Запланировано);
	ЗапросСобытия.УстановитьПараметр("РабочийЛист", РабочийЛистСсылка);
	ЗапросСобытия.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Состояние = &Запланировано
	|	И Событие.ДокументОснование = &РабочийЛист";
	
	Результат = ЗапросСобытия.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СобытиеОбъект = Результат.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Отменено;
		СобытиеОбъект.Результат = "Лид закрыт на портале Customer360.";
		Попытка
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СобытиеОбъект.ОбменДанными.Загрузка = Истина;
			СобытиеОбъект.Записать();
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры
